cases/01_h2_s2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       940;
    }
    outlet
    {
        type            patch;
        nFaces          10;
        startFace       950;
    }
    wall_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       960;
    }
    wall_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       1010;
    }
    fins
    {
        type            wall;
        inGroups        1(wall);
        nFaces          0;
        startFace       1060;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          500;
        startFace       1060;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          500;
        startFace       1560;
    }
)

// ************************************************************************* //
